Extensions/УВМ/Documents/КадровыйПереводСписком.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>КадровыйПереводСписком</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УВМ_Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УВМ_Руководитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Extensions/УВМ/Documents/КадровыйПеревод.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>КадровыйПеревод</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УВМ_Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Extensions/УВМ/Documents/КадровыйПереводСписком/Ext/ObjectModule.bsl
&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура УВМ_ОбработкаПроведения(Отказ, РежимПроведения)

	Документы.КадровыйПеревод.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);

	#Вставка
	//++dar 20221128 (11805)
	Если НЕ Отказ Тогда
		Узел = ПланыОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.НайтиПоКоду("851027ec-d2af-4799-bb1e-6aeedfaab22f");
		Для Каждого СтрокаТЧ Из Сотрудники Цикл
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, СтрокаТЧ.Сотрудник);	
		КонецЦикла;
	КонецЕсли;
	//--dar 20221128 (11805)
	
	//++dar 25.06.25 (255715)
	Если Дата >= УВМ_ОбщиеДоработки.ПолучитьДатуНачалаУчетаРуководителей() Тогда
		ТаблицаДвижений = Новый ТаблицаЗначений;
		ТаблицаДвижений.Колонки.Добавить("Период");
		ТаблицаДвижений.Колонки.Добавить("Физлицо");
		ТаблицаДвижений.Колонки.Добавить("Руководитель");
		ТаблицаДвижений.Колонки.Добавить("КадровыйДокумент");
		ТаблицаДвижений.Колонки.Добавить("ДействуетДо");
		
		Для Каждого СтрокаТЧ Из Сотрудники Цикл
			НовДвижение = ТаблицаДвижений.Добавить();
			НовДвижение.Период = СтрокаТЧ.ДатаНачала;
			НовДвижение.Физлицо = СтрокаТЧ.ФизическоеЛицо;
			НовДвижение.Руководитель = СтрокаТЧ.УВМ_Руководитель;
			НовДвижение.ДействуетДо = СтрокаТЧ.ДатаОкончания;
			НовДвижение.КадровыйДокумент = Ссылка;
		КонецЦикла;
		
		УВМ_ОбщиеДоработки.СформироватьДвиженияПоРуководителям(ТаблицаДвижений);
	КонецЕсли;
	//--dar 25.06.25 (255715)
	#КонецВставки

КонецПроцедуры

&После("ОбработкаУдаленияПроведения")
Процедура УВМ_ОбработкаУдаленияПроведения(Отказ)
	//++dar 25.06.25 (255715)
	Если Дата >= УВМ_ОбщиеДоработки.ПолучитьДатуНачалаУчетаРуководителей() Тогда
		УВМ_ОбщиеДоработки.УдалитьДвиженияПоРуководителям(Ссылка);
	КонецЕсли;	
	//--dar 25.06.25 (255715)
КонецПроцедуры

&Перед("ОбработкаПроверкиЗаполнения")
Процедура УВМ_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	//++dar 25.06.25 (255715)
	Если Дата >= УВМ_ОбщиеДоработки.ПолучитьДатуНачалаУчетаРуководителей() Тогда
		ПроверяемыеРеквизиты.Добавить("Сотрудники.УВМ_Руководитель");
	КонецЕсли;
	//--dar 25.06.25 (255715)
КонецПроцедуры
